[{"title":"《增长黑客》读书笔记","date":"2017-01-20T05:16:00.000Z","path":"2017/01/20/《增长黑客》读书笔记/","text":"前言： 本篇主写阅读《增长黑客》过程中的读书笔记，这是我第一次主动去写读书笔记，也参考了一些读书笔记写法，如若无兴趣，可直接跳过此篇。PS：简书的Markdown真的是好东西啊（妈蛋就是个好东西） 阅读耗时：161018-161208 书籍作者：范冰 在我的记忆里，“黑客”一词，来源于电影《黑客帝国》。再到后来工作中，有幸认识几个电脑极客，也算是打破了对于“黑客”飘逸潇洒的印象认知。 这是一本关于用户增长、产品相关内容的书。主体以AARRR模型的形式进行内容讲解。作为读书笔记，我将写下那些看过后，觉得需要反复咀嚼，想要记住的摘录及感悟。 PS：以下内容十分多，并且由于是记录给自身回顾的，若无法理解，可参照原书，每处都注明页数。 笔记部分——以下是一些摘录内容及感悟“AARRR”模型（转化漏斗模型）可以应用于生活中的很多事情上，对于运营的同学相对是不陌生的。它对应着用户生命周期的五个阶段Acquisition（获取）、Activation（激活）、Retention（留存）、Revenue（收入）、Refer（传播）。 安迪的经历（书中p12-p15）可以很好的理解增长黑客的职责、做什么。简直帅爆了这人。 懂技术，未必能变成好的增长黑客，而倘若不懂技术，无异于刘姥姥进大观园（p21） 一句话解释了在新的互联网时代，编程能力的重要性，或许不久的将来，编程会变成一项必备的生存技能（英语也是）。其实很多时候我们做事情都开始有功利性起来，但我要避免功利性的阅读，可以有优先级的阅读，但不要觉得那些非工作相关的书籍“没用”！ 一样东西“能不能造出来”早已不是问题，该冷静追问的是这样的东西究竟“该不该造出来”。（p39） 这是讲述产品PMF阶段（product-market fit）的一段话，PMF意为产品市场匹配。出自于《精益创业》一书。是一种对于一个公司不难理解却不容易达到的状态。“需求”永远是每个产品经理都需要关注的对象，正确的理解自身产品所能和市场契合的点，所能满足的需求，才是做好一个产品的正确方向。 用最小化可行产品验证需求（p49） 这也是精益创业一书提到的概念，MVP（Minimum Viable Product）最小化可行性产品。通过实现一两个核心需求（探索阶段），打造一个MVP产品，迅速投入市场，接收用户反馈，快速迭代（为了迅速调整，找到核心需求），让产品迅速达到PMF状态。它包含三个要素。 最小化可行产品 用户反馈 快速迭代 甚至很多时候我们可以直接在微信公众号上，实现产品的MVP开发。而使用php开发，就显得十分轻便了。（公众号开发策略p55） “行胜于言”的用户调研（p62） MVP产品有三大必备模块（p59） 反馈渠道 公告看板 自动升级 而这其中，还需要包括使用行为统计这件事在里边。 Acquisition（获取用户） 如果你不了解你女性，你将失去一半以上的用户 这个观点针对的是社交类产品的冷启动阶段（种子用户获取阶段），一个不会把妹的社交产品经理，或者说一个不懂得女性心理的产品经理，要跪。 从最笨的事情做起（p68） 讲了很多个有趣的案例，包括陈欧如何解决聚美优品早期的冷启动阶段 看一个产品团队是否有经验、一款产品有无“明星相”，只要考察他的产品设计中是否加入了解决冷启动问题的社交传播机制，就能略知一二。 这句话，我现在还不太懂。一个产品前辈告诉我：互联网靠的是实战，只有通过丰富的实战，你才能获得所谓的经验。 纸上得来终觉浅，实战践行才是互联网生存的王道。 大姨妈通过副标题巧堆关键字（p92） 6的飞起的搜索引擎优化案例！在这案例，书中这附近还有几个很经典的案例，可以到时一起翻看。包括为用户考虑的满意度调查弹出机制、“残忍拒绝”由来原因等。 搜索引擎和应用商店的优化营销（p89）很多的案例，可以看看。 文案能力是至关重要的。作为增长黑客能力模型中的重要组成部分，文案写作是当代商业社会的基本技能，能综合反映一个人的全部经历、气质、学识、深度思考和以卖出产品或服务为目的、将他们落实成符号表征的能力。（p105） 文案能力，至关重要！里边有相关要求，准则还有一个宣传文章撰文谋篇布局的优秀建议顺序：简要概述→话题事件→核心特色→主要功能→团队访谈→未来计划→有奖活动→转化引导 不要用战术的勤奋来掩盖战略的懒惰 傅盛的猎豹移动案例（p115），走向海外市场的好案例。 Activation（激发活跃） 这一章讲了很多案例。可以回头去重温下。 A/B测试中，不同方案之间只存在一个变量，排除其他干扰因素（p121） 这里详细讲了AB测试的基本思想、操作方式以及很多案例（很多案例我都去体验了，书中留下我的体验感觉）。还提到了色彩心理学（可以看看乐嘉的） 移动应用的A/B测试（p128） 移动应用可参考百姓网，根据移动端的功能进行高度抽象化，让前端架构可通过后台直接配置，前台则是纯HTML5容器。 这篇很多需要反复思考，包括设计移动端产品架构时，需要考虑如何基于现有业务设计，以及未来的延展性。但也要警惕移动端AB测试过于依赖架构。（这里作者没有举例说明，我也留下疑问） 另辟蹊径，降低用户活跃门槛（p133） 这是开脑洞的一小章节，很多思维精妙的产品解决思路（包括wifi万能钥匙如何解决iPhone系统限制、skype如何脱颖而出、QQ音乐锁屏歌词等等） 游戏化策略，其本质是一种建立、解决和改善沟通问题的工具，目的早已超越了单纯的娱乐。(p139) 游戏化产品设计（星巴克案例等等），包括我一直用的得到app，最近也加入了游戏化设计。这是一个锦上添花的产品运营设计 ，使用也应该在产品走上正轨后去使用。只有当你的产品核心需求功能完善后，才应该去考虑这种问题。 Retention（提高留存） 在商业社会中5%的客户留存率增长意味着公司利润的30%增长。 留住已有用户胜过拓展新的客户 （p152） 用户留存率低有几种可能原因： 程序有bug，性能有问题 用户被频繁骚扰 话题产品热度降低 出现更好的替代产品 其他未知原因（如游戏通关、设备遗失、需求不存在、产品生命周期终结等） 留存率的衡量（p155）可以以后作为参考。 像这样审慎地进行每一像素的开发，宁可麻烦自己，也绝不拖累用户。抱着这样的觉悟和诚意去用心做产品，相信一定能让有用户感受到。 以上讲的是instagram的优化案例，用心优化产品，用心做产品，不仅仅是在“做产品”上，做男朋友，做儿孙，做丈夫，做朋友，做学生……走心，总比走肾来的更长远。 有损服务——放下不必要的坚持（p160）提供产品服务，一定要保证核心服务可使用，宁可放弃掉某些体验上的优化点，一定，一定要保证核心功能不受影响。 里边还是包括一些案例，可以辅助理解。实施有损服务，两条基本原则：1.发生问题是，优先保证核心功能运转，非核心功能不可影响核心功能2.条件允许下，牺牲的特性越少越好。 same案例之所以马克这个案例，是因为我是same的早期种子用户，早期没什么附近人、也没社交网络账号，还不能关注，基本上就是一种孤独社交，或许，孤独是那么的美丽，才让我一直很享受这种感觉。那时还差点和一个妹纸网恋哈哈好天真那时 Revenue (增加收入)（p181）都是案例，直接看书吧，包括免费的精髓，如何引导收费。 Refer（病毒传播）本篇案例居多，配合案例更好理解。（p212）K因子、病毒循环周期。这两个概念很重要。K因子：用户评判病毒传播的覆盖面。公式：K因子= 感染率X转化率。（p212）病毒循环周期 ：指从用户发出病毒邀请，到新用户转化（如阅读文章，消费，以转化的目标考量）的所花费的时间。 坏事传千里——BUG营销（213）牛逼的百度云盘营销案例！ 后边的内容包括案例、工具介绍、博客介绍。（未完，以后补充前边笔记）","comments":true,"tags":[{"name":"读书笔记 产品","slug":"读书笔记-产品","permalink":"http://yoursite.com/tags/读书笔记-产品/"}]},{"title":"B端产品经理的自我提升之路","date":"2017-01-17T09:34:30.000Z","path":"2017/01/17/B端产品经理的自我提升之路/","text":"本篇是作为一篇对自己的思维整理和职业发展梳理，输入了东西一定要转化为输出强化印象。成长，是一辈子的事，想清楚后，脚踏实地的把能力提高起来吧。 前段时间一直纠结是做B端产品好还是C端产品好这两个大方向迟疑着。但和多位同行和前辈交流后，加上覃浩tommy前辈、刘飞前辈的知识分享，以及三节课的布棉老师点拨，让我坚定了成为优秀2B产品经理的决心。附上覃浩前辈的知乎答案链接 to B 的产品经理和 to C 的产品经理有什么差别？ to B 的产品经理的价值如何体现？ 那么，在进行提升分析之前，我们需要明确B端产品的能力要求。 ###通用部分： 逻辑思维能力 沟通能力 PRD等文档编写能力 原型绘制能力 学习能力 通用部分是作为产品经理必备的技能。也是基础（很重要）。这一点不管是B端还是C端产品，都属于基础知识，一定要认认真真做好，半点马虎不得。 ###B端产品能力要求部分： 具备优秀需求梳理能力 优秀的推动能力 优秀缜密的逻辑思维能力 对于以上几点b端产品能力要求有以下几个原因： 2B产品经理通常需求是来源于公司战略或者已有的业务流程，产品经理要做的是对已有业务的理解和实施，并将已有的业务流程等梳理规范化、系统化。若没有很强的需求梳理能力，很难将这类流程逻辑梳理出来。 并且，通常这类功能都会涉及到跨多个部门，多个部门很有可能目标是不一致的，若没有优秀的推动力，是不可能推动公司这么多部门同时为构建你的目标而努力的。所以需要具备优秀的推动能力（领导力） 以上两点是对2B产品经理最大的要求。b端产品经理一般都拥有缜密的逻辑思维。（需要考虑好每个流程、涉及到的每个利益方，所以需要思考很缜密） 以上就是我目前对于b端产品经理能力的要求理解。 ####那怎么去自我提升呢？ 在我认为，最重要两点： 一、在职业发展方向明晰的前提下，不断专研所在领域的知识，深耕多年，最终让自己成为该领域的专家。 二、查缺补漏，依据上边B端产品提到的前两点要求以及通用技能要求，不断对比自身，自我查缺补漏升级。这里一定不能忽略对基础通用知识的重视。（对于未满3年经验的PM而言） 在这我想引用A前辈的产品经理十年经历（来源100offer），作为一个辅助参考。 交代下A前辈的背景，2004年普通本科毕业，2005年开始到北京从事产品经理职位 这是A前辈工作10年+积累出来的简历。可以看出A前辈专精于B端领域的企业管理方面工作，职业规划十分明确，且工作都在三年以上。目前他手头拿着60W年薪的offer正和HR进一步沟通，而年薪50W的他还在观望中。 这无疑是一个十分值得参考学习的榜样。专精是一个趋势。本篇与其说指引，不如说是给自己的定心丸。 好好积累吧少年！依托耐心，成长为自己喜欢的样子。再附上Allen Zhang的一句话，作为自勉！ 「做产品要有自己的价值观、理念和愿景。是作品而不是产品，要做有灵魂的作品；产品中的文字反映你的气质，你的产品美感不会超越你的审美能力。」","comments":true,"tags":[{"name":"职业发展;产品","slug":"职业发展-产品","permalink":"http://yoursite.com/tags/职业发展-产品/"}]},{"title":"Keep产品中高保真原型还原","date":"2016-04-19T04:12:45.000Z","path":"2016/04/19/Keep产品中高保真原型还原/","text":"本次原型还原使用Axure，尽可能的还原，包括ps抠banner图在内，力求输出高保真原型，#产品汪的日常# #假装这个话题有人# 原型还原的目的有两个，提高软件使用熟练度，培养自身产品框架设计直觉，多练的同时要多总结，那种页面有哪几种设计方式等等。。 基本信息页面1用户界面 基本信息页面2用户界面 选择性别用户界面 训练页面用户界面 发现页面用户界面 关注页面-已关注用户界面 关注页面-小组用户界面 我 页面用户界面","comments":true,"tags":[{"name":"原型还原","slug":"原型还原","permalink":"http://yoursite.com/tags/原型还原/"}]},{"title":"Boss直聘app产品还原","date":"2016-04-09T04:13:49.000Z","path":"2016/04/09/Boss直聘app产品还原/","text":"写在最前：这是第一个版本的文章，以后还会继续修改，使用的是在线工具墨刀画原型，visio画流程图。机型：iphone6系统版本：ios9.3.1产品名称：Boss直聘4.3 【登录页面】 【密码登录】 【职位页面】 【职位详情】 【公司页面】 【公司详情页面】 【消息页面】 【聊天详情页面】 【我的页面】 【我的微简历】 【编辑求职意向】 【编辑微简历】 【boss版个人信息】 然后是手绘部分，画的有点丑，哈哈 【登录页面】 【密码登录】 【职位页面】 【职位详情】 【消息页面】 【聊天详情页面】 【我的页面】 小结：流程图感觉有点拖沓，但还是欠缺指导，希望各位多多评论给建议一只渴望入行的产品汪","comments":true,"tags":[]},{"title":"网易云音乐产品体验报告","date":"2016-03-13T13:37:44.000Z","path":"2016/03/13/网易云音乐产品体验报告/","text":"体验环境体验机型：iphone6系统版本：ios9.2.1产品名称：网易云音乐3.3.1体验日期：3.8~3.11 产品介绍网易云音乐是一款专注于发现与分享的音乐产品，依托专业音乐人、DJ、好友推荐及社交功能，在线音乐服务主打歌单、社交、大牌推荐和音乐指纹，以歌单、DJ节目、社交、地理位置为核心要素，主打发现和分享。 7月14日，网易云音乐宣布其用户数突破1亿，而我也是从14年底被安利后离开虾米音乐，入坑至今。音乐社交越来越显现，15年移动用户为12亿，移动音乐用户为8.6亿，渗透率为71.7%， 用户画像 可以看出，使用网易云音乐的主要群体还是以90后居多,说明年轻人乐于接受新兴事物，喜欢好玩有趣的有个性。 用户需求总体来说，听歌，社交，发现，涵盖了大部分音乐爱好者的需求。 听歌，这是最最基础的音乐需求，闲暇，上下班途中，音乐的伴随，能很好的稀释无聊。 社交，一个人呆久了，就想要和社会有联系，音乐社交可以分为几种，一种是音乐分享，听到喜欢的音乐分享出来，让别人了解你的音乐品味，另一种是音乐交流，和志同道合的人开心聊天。 发现，人喜欢有个性，所以如果能发现一些小众的，不是烂大街的音乐，能很好地体现个人的个性品味和特别。 行业分析用户规模 根据TalkingData 15年移动音乐应用行业报告，可以看出移动音乐71.7%的用户渗透率。音乐确实是重要的生活方式。 行业发展 中国数字音乐行业在14年达到了96.亿的规模，15年增至125.2万亿，随后的专业预测也是一片看好数字音乐的发展，未来在音乐版权方面的竞争将越来越激烈，这将让音乐版权越来越得到重视，而进而激发音乐人的自我创造，这将是一个很大的发展潜能。 产品体验 用户体验流程图 这是我第一次画用户流程图，看别人的用户流程十分简单，本来自己觉得听歌听完之后，用户如果喜欢的话，还会继续选择分享甚至是社交，这里留下一个疑问，还请各位多多给建议(^__^) 歌单 在体验歌单过程中发现一点有点抓狂，无法多选歌单风格，比如说，我想要听华语后摇，怎么选？ 我想可能不给多选也是因为内容筛选方面，如果做了多选的话，对于运营和技术后台来说运营难度的成本加大，可能是一个功能没有实现的一个原因。 私人FM &amp;&amp; 跑步FM 私人FM我用了有一段时间了，之前一直听中文流行歌，但前几天了解到后摇后搜索了几首后摇，结果现在私人FM全部都变成了后摇系列。。。。。我的内心几乎是奔溃的，当然，可能对于私人FM的后台智能数据库，对于技术实现难度以及大数据的准确性来说，实现起来还是成本比较高。总体而言我还是比较喜欢网易云的私人FM，建议不要在用户这段时间忽然听了某一个歌种或者主题后，就全部换成那一个歌调，可以关注一段时间内的用户听歌频率高的是哪些歌曲类型（比如说一个月内）。 跑步FM初步体验了一下，大概清楚了其原理，步数猜测是依据手机本身有个倾斜感应，然后有个幅度范围，如果我们是慢跑的话幅度会比较小，以此有一套算法可以去算出你的速率，然后依据速率选出对应的歌曲库，比如我一开始测试慢走模式，跑步FM推了一首我蛮喜欢的后摇，接下来，我换成了快跑，重新测试，他就来了首摇滚，总体感觉功能还不够智能，比如说我忽然从慢走状态到快跑，应该直接切换成快跑曲库，会比较更符合用户场景。 音乐播放页面 来到了用户口碑最好的音乐播放场景，老唱片的缓慢旋转是我一开始喜欢网易云音乐的一个开始，据说当年为了找出这个最佳旋转速率，网易云音乐产品方面专门去找了台老式唱片机运转一个多小时算出最佳速率， 可见一个好的产品的细节，都有一段有趣的故事。文艺黑胶老唱片，界面设计，十分喜欢。这里有一个显示当前歌曲的评论数的小细节，听这首歌瞬间就知道是热门还是说小众歌曲，点进去你会发现网易云十分难得的音乐社区氛围，没有撕逼，没有派别，有的只是对音乐的不同欣赏和各种品味碰撞。 功能完善建议1、歌单增选多选歌单选择时，可以进行多选，可以贴切用户期望，过滤更多无用信息歌单有点多，也可以进一步优化细分。比如控制在不需要下滑查看的内容长度。 2、跑步FM功能优化监听步数时，不应以开始时搜集的数据作为基准，宜以一个时间段为统计，更贴切的推荐跑步音乐 3、本地上传歌单建议我时常有这样的烦恼，明明是我客户端上传的歌曲新建的歌单，为何每次播放这个我本地上传的歌单，全部歌曲都要缓存了？ 建议云音乐库添加本地音乐库的识别串联，降低用户使用成本。 PS：本文为林咖喱的首篇产品体验报告，其中一定会有很多不足，十分希望各位能多多提意见，或者更好的学习投稿建议， 我是林咖喱，一个有理想，有小小忧伤的产品新人:P","comments":true,"tags":[]}]